# Output from `brew bundle dump --describe`

tap "cadeef/tap", "git@github.com:cadeef/homebrew-tap.git"
tap "keith/formulae"

# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Utility that creates projects from templates
brew "cookiecutter"
# Command-line tools for fly.io services
brew "flyctl"
# GitHub command-line tool
brew "gh"
# Command-line utility for uploading Gists
brew "gist"
# Configurable static site generator
brew "hugo"
# Interactive computing in Python
brew "ipython"
# Linux virtual machines
brew "lima"
# CLI for Node.js style checker and lint tool for Markdown files
brew "markdownlint-cli"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Experimental optional static type checker for Python
brew "mypy"
# Python package management tool
brew "poetry"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Interpreted, interactive, object-oriented programming language
brew "python3"
# Safe, concurrent, practical language
brew "rust"
# Experimental Rust compiler front-end for IDEs
brew "rust-analyzer"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Command-line interface for SQLite
brew "sqlite"
# Newer: Vi 'workalike' with many additional features
brew "vim"

brew "keith/formulae/reminders-cli"
# Command-line interface for 1Password
cask "1password-cli"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
# Store SSH keys in the Secure Enclave
cask "secretive"
