tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "puppetlabs/puppet"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# Record and share terminal sessions
brew "asciinema"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Robust and modular log colorizer
brew "ccze"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Cluster ssh tool for Terminal.app
brew "csshx"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Compiler for writing C extensions for the Python language
brew "cython"
# Message bus system, providing inter-application communication
brew "dbus"
# Secure communications between a client and a DNS resolver
brew "dnscrypt-proxy", restart_service: true
# GNOME XML library
brew "libxml2"
# Measure DNS performance by simulating network conditions
brew "dnsperf"
# Standard SGML representation system for technical documents
brew "docbook"
# XML vocabulary to create presentation-neutral documents
brew "docbook-xsl"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Command-line tool for DigitalOcean
brew "doctl"
# Modern replacement for 'ls'
brew "exa"
# CLI tool for quick access to files and directories
brew "fasd"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Command-line utility for uploading Gists
brew "gist"
# Distributed revision control system
brew "git"
# Portable Foreign Function Interface library
brew "libffi"
# GNU multiple precision arithmetic library
brew "gmp"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Asynchronous event library
brew "libevent"
# X.509 and CMS library
brew "libksba"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Improved top (interactive process viewer)
brew "htop"
# Configurable static site generator
brew "hugo"
# Display an interface's bandwidth usage
brew "iftop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Generic library support script
brew "libtool"
# Creates dependencies in makefiles
brew "makedepend"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Tail multiple files in one terminal simultaneously
brew "multitail"
# Network grep
brew "ngrep"
# Port scanning utility for large networks
brew "nmap"
# Tool for creating identical machine images for multiple platforms
brew "packer"
# Parallel gzip
brew "pigz"
# Show ps output as a tree
brew "pstree"
# Monitor data's progress through a pipe
brew "pv"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id"
# Proxy server that works as a poor man's VPN
brew "sshuttle"
# User interface to the TELNET protocol (built from macOS Sierra sources)
brew "telnet"
# Tool to build, change, and version infrastructure
brew "terraform"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Tools for building TCP client-server applications
brew "ucspi-tcp"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# Lookup tool for domain names and other internet resources
brew "whois"
# Graphical network analyzer and capture tool
brew "wireshark", link: false
cask "wireshark"
cask "vagrant"
cask "virtualbox"
cask "puppetlabs/puppet/pdk"
